In [2]:
#adding all imports
import pandas as pd
import matplotlib.pyplot as plt
from sqlalchemy import create_engine

In [4]:
#creating engine
from config import Password 
engine = create_engine(f'postgresql+psycopg2://postgres:{Password}@localhost:5432/employee_db')
connection = engine.connect()

In [8]:
#obtaining data from salaries table
salary_db = pd.read_sql("Select * FROM salaries", connection)
salary_db = salary_db.dropna()
salary_db.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228